In [1]:
import pandas as pd

In [16]:
lst = [['tom', 25,50,20000,'UK'], ['krish', 30,66,32000,'IND'],['adibrao',35,68,54000,'IND'],['martin',28,59,46000,'US'],['yasir',32,60,72000,'IND'],
['prem',33,None,None,'US'],['nick', 26,45,60000,'US'], ['juli', 22,77,50000,'IND'],['kishor',31,59,35000,'IND'],['venba',21,50,15000,'IND'],['maggie',24,50,20000,'IND'],['raghavan',45,53,45000,'IND']] 
    
df = pd.DataFrame(lst, columns =['Name', 'Age','Weight','Salary','Country'])

In [17]:
df.head(5)

      Name  Age  Weight   Salary Country
0      tom   25    50.0  20000.0      UK
1    krish   30    66.0  32000.0     IND
2  adibrao   35    68.0  54000.0     IND
3   martin   28    59.0  46000.0      US
4    yasir   32    60.0  72000.0     IND

In [18]:
df.describe()

             Age     Weight        Salary
count  12.000000  11.000000     11.000000
mean   29.333333  57.909091  40818.181818
std     6.637816   9.575537  18131.840402
min    21.000000  45.000000  15000.000000
25%    24.750000  50.000000  26000.000000
50%    29.000000  59.000000  45000.000000
75%    32.250000  63.000000  52000.000000
max    45.000000  77.000000  72000.000000

In [19]:
df.isnull().sum()

Name       0
Age        0
Weight     1
Salary     1
Country    0
dtype: int64

In [22]:
df.groupby('Country')